app/views/pins/_form.html.erb

SELECT `categories`.* FROM `categories` ORDER BY `categories`.`name` ASC
---
    <%= f.input :category_id, input_html: { class: 'form-control' } %>
    <%= f.collection_select :category_id, Category.order(:name), :id, :name, { include_blank: true }, class: 'form-control' %>