app/views/pins/index.html.erb

  <div class="col-md-8">
      <% tag_cloud(Tag.counts, %w{tag1 tag2 tag3 tag4 tag5}) do |tag, css_class| %>
---
SELECT `tags`.* FROM `tags`