app/views/pins/show.html.erb

SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.`id` = `taggings`.`tag_id` WHERE `taggings`.`pin_id` = 5
---
      <section class="footer-summary">
        <%= raw @pin.tags.map(&:name).map{ |t| link_to t, tag_path(t), class: 'btn btn-primary'}.join('') %>