app/controllers/admin/categories_controller.rb

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
---
  def set_category
    @category = Category.find(params[:id])