app/controllers/admin/pins_controller.rb

INSERT INTO `pins` (`title`, `description`, `created_at`, `updated_at`, `user_id`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`) VALUES ('Vova', 'asfaffffefefefefe\r\nfefefefefe\r\nfefe\r\nfe', '2020-10-28 20:56:47', '2020-10-28 20:56:47', 1, 'guidetomen-(2).jpg', 'image/jpeg', 112330, '2020-10-28 20:56:47')
---
  def create
    @pin = current_user.pins.build(pin_params)

    if @pin.save

UPDATE `pins` SET `description` = 'asfaffffefefefefe\r\n', `updated_at` = '2020-10-28 21:05:09' WHERE `pins`.`id` = 1
---
  def update
    if @pin.update(pin_params)

SELECT  `pins`.* FROM `pins` WHERE `pins`.`id` = 1 LIMIT 1
---
  def find_pin
    @pin = Pin.find(params[:id])