app/views/admin/pins/_form.slim

    = f.input :category_id, input_html: { class: 'form-control' }
    = f.collection_select :category_id, Category.order(:name), :id, :name, { include_blank: true }, class: 'form-control'
  .form_group
---
SELECT `categories`.* FROM `categories` ORDER BY `categories`.`name` ASC