app/views/tags/show.html.erb

SELECT  1 AS one FROM `pins` INNER JOIN `taggings` ON `pins`.`id` = `taggings`.`pin_id` WHERE `taggings`.`tag_id` = 1 LIMIT 1
SELECT `pins`.* FROM `pins` INNER JOIN `taggings` ON `pins`.`id` = `taggings`.`pin_id` WHERE `taggings`.`tag_id` = 1
---

<% if @tag.pins.empty? %>