app/controllers/pins_controller.rb

  def index
    @pins = Pin.all.order("created_at DESC")
---
SELECT `pins`.* FROM `pins` ORDER BY created_at DESC

  def set_post
    @pin = Pin.find(params[:id])
---
SELECT  `pins`.* FROM `pins` WHERE `pins`.`id` = 0 LIMIT 1